tap "homebrew/bundle"
tap "homebrew/services"
brew "cmake"
brew "git"
brew "libpq"
brew "mono"
brew "neovim"
brew "nvm"
brew "postgresql@17", restart_service: true
brew "rbenv"
brew "tmux"
cask "font-jetbrains-mono-nerd-font"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "github.github-vscode-theme"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "twxs.cmake"
